{"m":[{"id":0,"uid":"b155cae463b1bdad878b15d54b3427a77590ce6c","lak":"ee63f82861674523ec6d5431df2a795fb909e2bbc6b7ab3d9fc65b59c75daa1d","ts":1303643885105,"s":"What Kinect Could Be, But Probably Won't","t":"An opinion piece at CNN looks at Microsoft's Xbox Kinect, praising the \u000a\u0009    system's capabilities not for gaming, but for what it does to the video \u000a\u0009    viewing experience. \"The idea of being able to ditch your table full of \u000a\u0009    remote controls and just use your hands and voice to interact with the TV \u000a\u0009    is compelling. It's much nicer than QWERTY keyboards, which are a terrible \u000a\u0009    idea in the living room. It's also better than Wii-like remote controls, \u000a\u0009    or even using an iPad or smartphone as your TV remote, a feature that \u000a\u0009    cable companies are increasingly rolling out.\" The problem, as they see it, is \u000a\u0009    Microsoft's inability to actually bring this into common usage for regular \u000a\u0009    television viewing. \"It seems like the company is tied too much to the \u000a\u0009    Xbox's substantial gaming revenue to split the Xbox TV stuff off as a \u000a\u0009    separate product — even though there's a huge population of non-gamers who \u000a\u0009    probably have no interest in buying an Xbox.\" Perhaps this is something that \u000a\u0009    can be addressed by others when the Kinect SDK is released."},{"id":1,"uid":"b155cae463b1bdad878b15d54b3427a77590ce6c","lak":"ee63f82861674523ec6d5431df2a795fb909e2bbc6b7ab3d9fc65b59c75daa1d","ts":1303643902116,"s":"Japanese Robots Await Call To Action","t":"Kyusaku Natsume writes with this excerpt from a Kyodo News report on the \u000a      robots Japan has available on standby to work at the troubled Fukushima \u000a      Daiichi plant: \"Japanese robots designed for heavy lifting and data \u000a      collection have been prepared for deployment at irradiated reactor \u000a      buildings of the Fukushima No.1 nuclear power station, where US-made \u000a      robots have already taken radiation and temperature readings as well as \u000a      visual images at the crippled facility via remote control. ... Enryu \u000a      (rescue dragon) was developed in the aftermath of the magnitude-7.3 Great \u000a      Hanshin Earthquake that hit the Kobe area in 1995. Designed to engage in \u000a      rescue work, the remote-controlled robot has two arms that can lift \u000a      objects up to 100 kg. It has 'undergone training' at the Kitakyushu \u000a      municipal fire department in Fukuoka Prefecture.\""}]}
